app/controllers/school_classes_controller.rb

    def create
        @schoolclass = SchoolClass.new(post_params(:title, :room_number))
        @schoolclass.save
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Comp Sci"], ["room_number", 5], ["created_at", "2018-04-30 21:44:29.274032"], ["updated_at", "2018-04-30 21:44:29.274032"]]

    def update
        @schoolclass = find_class(params[:id])

        @schoolclass.update(post_params(:title, :room_number))
---
UPDATE "school_classes" SET "title" = ?, "room_number" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Risk Analysis"], ["room_number", 10], ["updated_at", "2018-04-30 21:43:33.536969"], ["id", 1]]

        def find_class(param)
            SchoolClass.find(param)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT 1  [["id", nil]]