app/controllers/schoolclasses_controller.rb

SELECT "schoolclasses".* FROM "schoolclasses"
---
    def index
        @schoolclasses = SchoolClass.all

SELECT  "schoolclasses".* FROM "schoolclasses" WHERE "schoolclasses"."id" = ? LIMIT 1  [["id", 1]]
---
        def find_class(param)
            SchoolClass.find(param)